[
	{
		"topic": "Indian Goods Vs Chinese Goods",
		"content": "<b>Quote :</b> 'Quality of the product determines the real value of the product not the quantity' OR 'Vocal for local'<br><br><br><b>Intro :</b> The Topic is great and is mostly emerged due to current conflict between the two countries. 'Made in China' we Indians are familiar with this words. Most of our day to day life accessories are from made in China. Let's be practical - Great example is Phones ! 'Redmi 9 pro sold out in 90 secs', we could see the demand for the products, all because of low cost making it affordable to everyone. This is seen because the India's major part is of middle class who opt for cheaper products<br><br><b>Intro2 :</b> The Topic is great and is mostly emerged due to current conflict between the two countries. 'Made in China' we Indians are familiar with this words. Most of our day to day life accessories are from made in China. Let's be practical - India follows 80:20 rule which means 80% people is having 20% money and 20% people is having 80% money, if we will talk about 20% people the can purchase any costly goods and Indian goods are not that much cheaper. But what about 80% people, they will purchase Chinese product.<br><br><br><b>For Chinese Goods : </b><br>• China is known for their massive production in industrial goods which reduce the production cost.<br>• There is a huge variety and easy availability of Chinese products which give customers more option to choose as per their requirement.<br>• Quality of the product, China used to produce low-quality products which have added to the bad image of the country so the Chinese government has taken steps to check the quality of the product. From this move, China has emerged back as the hub of production. Moreover, most of the popular company like Apple, HP, Dell are producing their technical product in China so stating that goods produced in China have lacked in quality is not justified.<br>We can't deny the fact that many Indian products also lack quality like the Micromax phones or the Freedom 251 that was promised<br>• Most of the Indian companies are totally depends on Chinese technology there is million dollar trading going on every day between Chinese and Indian company so it is also boosting our economy also.<br>• Chinese products are good for poor peoples, generally, there is a very short option for poor’s to get a high-quality product but due to cheap Chinese product, they can make their life better.<br>• If we talk about GDP and economy, Chinese goods or companies have their service centers setup here to it also indirectly provides employment<br>• For making various 'Indian Goods', the spare parts or components are majorly imported from China. Pharma companies also largely depend on China for APIs<br><br><br><b>For Indian Goods : </b><br>• I agree that Chinese goods are the cheapest compared to the Indian ones. But, we should not consider cost over quality. Most of the Indian company give 3 to 12 year or more than that time guaranty or warranty on their product quality but there is no such kind guaranty or warranty is available on Chinese product. So, there is a question of durability and dumping. So to counter this Gov has imposed anti-dumping duty on goods in 2019.<br>• Indian product is almost similar on price range and sometimes it is much cheaper then Chinese product due to raw material is available in India.<br>• Indian government and private sector now taking big steps towards increasing the quality of Indian products.<br>• Some of the achievements of India like mars mission or Mangalyaan and Chandrayan or moon mission launched by ISRO or Indian space research organization proved that India is also a master of innovation in technology which is better than any other country.<br>• Sometimes Indian products are high in cost then Chinese product but Indian product is more durable and this long-lasting capacity saves lots of money other hand Chinese products are very cheap but not durable for this reason a person bound to purchase the same product again and again which in long run cost more.<br>• It increases the employment opportunities for Indians.<br>• Government policies - Gov has come up with many policies 'Make in India' to boost indigenous products<br><br><br><b>Conclude :</b> Yes, Chinese product are now dominating Indian market but it is known to everyone that Indian products are more reliable and durable then Chinese goods. Due to lack of technology production rate is less and cost is little more than chinese but it clearly seems that the Indian government now taking major steps to overcome this problem."
	},
	{
		"topic":"Merits and Demerits of Cashless Economy",
		"content":"<b><u><i>Alternate Topic : Is India ready to shift to Cashless Economy?</i></u></b><br><br><b>Intro :</b> As the saying goes 'A Card close by is worth bundles of money'. Be it a CreditCard or DebitCard, it always comes handy. According to TRAI, as on 30 September 2016, 82 out of 100 citizens in India owned a mobile phone. The evolution of the telecom ecosystem, with significant reduction in call and data rates, along with the prices of smart phones, is propelling the shift to a cashless economy. Cashless economy was boosted after Demonetization in India.<br><br><b>Merits or For the Topic:</b><br>• Less Time<br>• High Seigniorage : Country also saves money required to print notes. <br>• Maintains transparency in the system and prevents illegal trade = Helps in growth of country.<br>• Tension-free : Prevents thefts or worry of money being lost. The cards can be blocked from bank and moreover it requires pin for transaction.<br>• Job opportunities : After Demonetization, many mobile wallet companies were proved to be beneficial in this respect.Thus, these companies create job opportunities too!<br>• In this pandemic situation, cashless economy helped to prevent spread of disease by preventing exchange of physical money.<br>• Gov Policies : Direct Benefit Transfer or Pradhan Mantri Jan Dhan Yojna etc. boosted the cashless economy by creating bank accounts to provide benefits directly into consumers.<br>• Online products/ skip queue : All of us here must have booked a train or a movie ticket while siting in our room. What do we use there? Cashless mode of Payment ! This saves time, efforts and money too! Moreover at the places instead of cashless mode, if we had used hard cash, we might run into a problem of change. So if we had used cashless mode, swipe a card and boom the payment's done! Thus it provides us speed and convenience.<br>• Discount : In order to promote digital method, gov along with banks are providing discounts for various items like ICICI giving 1% discount on fuel purchase made on HP pumps, etc.<br>• Record : Helps to maintain a record of expenses.<br>• Cashless for illiterates : Aadhar based cashless transactions are also available<br>• India has started initiative like BharatNet for banking infrastructure <br><br><br><i><b>Neutral pts :</b> There's always a first time, like computers, we were not comfortable initially but later adopted them. Unless and until you teach them, they will never learn.<br>Villagers can use Facebook WhatsApp then why not this? even this is possible ! I'll give you an example - There was an initiative taken where a village was taught to use cashless and a villager did a 1/- transaction. I agree we can instantaneously flip a switch but slowly and steadily we can.<br>Security - There's this issue in both. Physical notes were forged and in cashless one need to make sure than he doesn't share PIN. </i><br><br><b>Demerits or Against the Topic:</b><br>• Challenges with digitalization : Sudden change of mode<br>• Poor Infrastructure : According to latest reports there are hardly 4 lakh ATMs. There's a large deficit seen in adoption of the old system, at this stage how can we adopt the new tech.<br>• Connectivity issue : most of the places don't have access to internet in rural areas and using cards require stable connection<br>• Threats : If user doesn't have knowledge about the usage, the possibility of thefts is imminent. Be it a card transaction which requires only 4 digit pin or UPI pin for mobile transactions<br>• Transaction Fee : Credit / Debit Cards levy transaction fee per transaction. I agree latest gov policy have ensured Rupay cards won't levy fee but it also requires operating cost.<br>• Reluctant user : There is a huge increase in cyber crimes post lockdown, and due to inadequate knowledge about the system , users are reluctant to switch to cashless mode<br>• Refunding the money also takes much time.<br><br><br>Conclusion: A cashless economy is one step ahead for India. I agree there are loopholes everywhere and cash is not 100% replaceable but We must take a stand and welcome the new change by proceeding slowly and cautiously. Ensure Net connectivity and Digital Literacy and help our country grow !"
	},
	{
		"topic":"Is India ready for Electric Vehicles?",
		"content":"<b>Quote :</b> 'Death by Breath'<br><b>Intro :</b> Hello Friends! We are here to discuss on topic whether Indian is ready for Electric Vehicle ? Let us understand what are electric vehicles - Electric cars are the new-generation cars which are a replacement of the old petrol/diesel cars and automobiles. There are obvious advantages of Electric Vehicles(EV) which states fewer maintenance and environmental friendly nature but India is still in the preparation stage and doesn't have enough facilities ready for the transition.<br><br><b>Intro2 :</b> Hello Friends! We are here to discuss on topic whether Indian is ready for Electric Vehicle ? India is currently in the 13th position among the world's most polluted cities. There's a saying 'Death by Breath' which might soon turn true owing to rising pollution. Switching to electric vehicles is a step towards green economy. Considering the present situation, it may seem vital but there's still a lot to be done before India gets ready for Electric Vehicles.<br><br><b>For the topic :</b><br>• India has been importing 82% of its oil requirements and spends up to 85 billion dollars in a financial year for oil imports, according to the Indian oil ministry. Switching to electric mode might help to save our economy.<br>• India has been manufacturing indigenously and successfully using Electric Locomotives that pull train coaches with thousands of tons of load.<br>• Though the initial price of electric vehicles is high, they will become affordable with an increase in their demand.<br>• Prominent manufacturing companies like Mahindra & Mahindra, Hero electric vehicles, Maruti Suzuki have invested in various electric vehicles projects in India. <br>• Gov Policies :  The government has also launched schemes like FAME (faster adoption and manufacturing of electric vehicles) I & II and sanctioned a huge sum of amount for the development of hybrid and electric vehicles by providing subsidies on electric vehicles. Moreover in 2017, Transport Minister Nitin Gadkari shocked the automobile industry (and the world) when he announced that he intended for India to move to 100% electric cars by 2030.<br><br><br><b>Against the topic :</b><br>• In case of traditional vehicles, there are petrol pumps or Gas pumps (usually LPG) Is available within Kilometers. But for electric vehicles there is nothing not at all.<br>• As the total system will be supported by electricity, power cuts will have adverse effects. Even developed cities in India face power cuts today, let alone villages and other areas.<br>• EV, as we know will help a lot in reducing pollution but they are costly & not soo speedy. They provide a top speed of only 85km/hr which is far less than the fuel driven vehicles<br>• Just after nine months of the launch of Ola’s ambitious Electric Vehicle project in Nagpur, it faced major roadblock with Ola drivers wanting to return their electric cars and switch back to petrol or diesel variants. The reason being high operating expenses and long wait times at charging stations.<br>• Components : India still depends on major components like for battery on China, which is might be bigger turn off due to current clashes between the countries.<br><br><br>Conclusion : It’s a good thing to switch to EVs, as its an environment-friendly option and there exists immense opportunity for the growth of electric vehicles. but the government should ensure that the transition will be smooth."
	},
	{
		"topic":"Beti Bachao Beti Padhao : Will it abolish the orthodox mindset?",
		"content":"<b>Intro :</b> The saying goes 'When you educate a man, you educate a man but when you educate a woman, you educate a generation'. <i>Beti Bachao-Beti Padhao</i>, launched in 2015 in Haryana, is the social awareness campaign making the parents celebrate the birth of a baby girl instead of getting unhappy. There are many issues like female foeticides or abandoning the girl child, if at all she happened to be born or not allowing them for higher studies. To abolish all these, this campaign was started.<br><br><br><b>Benefits :</b><br>• The scheme aims at making girls independent both socially and also financially through education.<br>• Approach of the Government is to generate awareness and improve the efficiency of delivery of welfare services meant for women. <br>• Government has launched ‘Sukanya Samridhi Yojana’ for the benefit of Girl child. This is the highest interest carrying scheme with 8.1% interest rate per annum and only the parents of girl child (Maximum 2 upto the age of 10 years) can open this account in the Post office and banks authorized to open PPF accounts. The maximum limit of deposit is Rs.1.50 lakhs per annum.<br>• The effect of the Beti Bachao-Beti Padhao scheme is visible in a short period of 2 years of its launch. The sex ratio has crossed up to 950 females per 1000 males.<br>• During the last two years the ratio of women police officers has increased to 8.5% from the earlier 6 percent.<br>• Number of women are now joining Armed forces, becoming fighter pilots, scientists, doing research, sports, mountaineering, wrestling, journalism, engineers among others. Eg : Sania Mirza - Indian Tennis Player ranked #1 in women doubles <br><br><br><br><b>Hurdles :</b><br>• Government Machinery, police force not taking the complaints against atrocities on women seriously. This creates doubt on its effective implementation.<br>• Despite all the campaigning, the old mind set of the people has not changed.<br><br><b>Conclusion :</b> With the zest of celebrating the birth of a baby girl, we all must support the noble initiative Beti Bachao Beti Padhao. The scheme may make a call to people to end the discrimination between the sons and daughters and bring all-round progress in family, society, nation and world at large. We need a strong and determined society to balance the sex ratio and mark the rebirth of the new India."
	},
	{
		"topic":"Linking of Aadhaar: Is making Aadhaar mandatory a good idea?",
		"content":"<b>Intro :</b>The UIDAI was established on 28 January 2009 after the Planning Commission issued a notification. On 23 June Nandan Nilekani, the co-founder of Infosys, was appointed by the then-government, UPA, to head the project. The Aadhaar is a 12 digit special distinguishing proof number that each resident of India is qualified for get after he provides his demographic and biometric data. Demographic  data will consist of the name, age, sex and residential address, while Biometric data will incorporate organic attributes of the individual for example fingerprints, eye retina scan etc.<br><br><br><b>For the Topic :</b><br>• The Aadhar can work like the Social Security number in the USA. Thus, it can be used as a single link for all kinds of investments and activities. This will ease the business processes.<br>• Reduction of complexity in filling ITR's : The process of compiling and filing and Income Tax Return is an exhausting process. But with the use of Aadhaar as a form of verification, not only the time required for verification has reduced but the authenticity has also increased on account of reduction in documentation.<br>• Easier in getting passport : Getting a passport made is a long process. But due to Aadhaar, which serves as a proof of identity and address the entire process is speeded up as unnecessary delays in getting an appointment are reduced.<br>• Helps in getting pensions : Linking of Aadhaar with the pension account ensures that the pension amount reaches the recipient securely. It also reduces the hassle to physically visit the bank every time thus saving time and effort.<br>• Reduces the role of middlemen : With the advantage of Aadhaar, the new system ensures identification of beneficiaries to whom the subsidy is transferred directly without the hassle of it passing through the middlemen. It also includes subsidy in LPG or even getting a scholarship.<br>• Payments : Now payments can be done without knowing the bank account number, just Aadhar number linked to bank will be enough to transfer the funds.<br>• Verification : Aadhar has eased the SIM verification and other verifying services thus enabling us to use the services at the earliest.<br><br><b>Against the Topic :</b><br>• The Supreme court had itself asserted in 2013 that Aadhaar should be voluntary, not mandatory.<br>• The organizations state the Aadhaar numbers will be issued in around 90 days time yet much of the time, it takes between four to a half year. Numerous organizations are requesting extra information yet they are not conveying to the general population that everything isn’t obligatory and they don’t need to top off everything in the structure.<br>• There are numerous issues with UID's biometric information accumulation. Old age people have dry hands or prints have been lost, or even individuals which do hard labor work do not have proper prints. Retinal scans will be an issue with people having cataract problems.<br>• Data Security : There's a risk of data privacy and security issue where a breach might lead our sensitive data into hands of unauthorized individuals. In 2017, MS Dhoni's Aadhar data on Twitter was leaked exposing all the personal details, so how safe is our data? Another issue was the case of Bharti Airtel which was also an eye catcher where users bank account were opened without their consent by using Aadhar database.<br><br><br><b>Conclusion :</b> Aadhaar is definitely beneficial in making identification easier and reducing the time and errors that were involved in paper authentication. But making it mandatory with the unstructured framework of the Act and the inefficient bio-metric systems may result in the negative consequences."
	},
	{
		"topic":"Impact of Technology on Jobs: Will Automation & Artificial Intelligence reduce or increase Jobs?",
		"content":"<b>Quote :</b> 'Darwin's theory of evolution' or 'Survival of Fittest' or 'Change is a law of life'<br><b>Intro :</b> Technology intervention is inevitable in any sphere. It does raise the bar of productivity, efficiency and safety to a level which is not achievable by humans. Adoption of technology, global reach and faster communication has overhauled manufacturing, servicing, product delivery and also employment associated with these sectors. But, this is not the first time the world has experienced significant shifts in employment due to new technology. AI can be seen in cars, 3D printer, home and industrial automations, genomics, etc.<br><b>Intro2 :</b> Today the whole world is in the wheel of technology. The impact is much larger than we ever expected. We are living in 21st-century era and this era is known as the 'Technology era'. With just twinkling of our eyes the big official letters and important documents are send which was much difficult in earlier days. Tech is solving each and every problem of our daily life and each and every sector is using it.<br><br><b>Will reduce Jobs :</b><br>• Industries across the globe are adopting new technologies for higher efficiency and performance, lower manufacturing. Machines can reduce risk and increase effectiveness. This could lead to elimination of a vast number of semi or unskilled jobs, who make a substantial portion of the workforce in manufacturing and agriculture sector.<br>• Automation isn’t just for blue-collar workers anymore. Computers are now taking over tasks performed by professional workers, raising fears of massive unemployment.<br>• Technical advancement is forcing people to continuously update their knowledge to sustain in the job market. This can be too overwhelming for some to balance work and personal life.<br>• Dependency over machines will Increases and sudden breakdown might result into a greater impact.<br>• Less use of human creativity.<br><br><br><b>Jobs will not be lost :</b><br>• History is Evident: A lot was made about impending job losses when computers first made their foray. It was predicted that the computer would do the job of many people, and thus render people unemployed. This didn’t happen much, though there was a transition period, as we see take place now. Instead, computers unlocked a whole new set of employment opportunities.<br>• History is Evident(2): Automation is nothing new. It has been on ever since the first Industrial Revolution in England, back in the 18th Some might argue, it has been on ever since the dawn of human civilization, some five-thousand years back.<br>• According to research firm Gartner, more jobs will be created than lost by automation. The firm stated that though 1.8 million jobs will be eliminated by 2020, but 2.3 million new jobs will be created by then. <br>• The spurt of AI will reduce a number routine, mundane jobs,increases productivity and hence reduces the burden on workers. Instead, it will allow humans to concentrate on more creative aspects, such as towards business innovation.<br>• Several newer jobs have already sprung up. Data scientists and digital marketers for instance are a lot in demand now.<br>• With advent of new technologies industry experts see the need for skilled workers increasing in the short run and persisting for at least another decade.The experts call for training programs with a new curriculum and certifications to standardize emerging job classifications.<br><br><b>Conclusion :</b> The intervention of technology in any domain has become absolutely inevitable. Enabling more people to harness the benefits from technological advancements is in the best interest of any business or country. Continuous investment in technology without considering the impact on existing workforce could result in a host of other problems."
	},
	{
		"topic":"Social Media: A boon or a bane for society and individuals",
		"content":""
	},
	{
		"topic":"Crypto Currency: A bright future or just a fad?",
		"content":""
	},
	{
		"topic":"Make in India: The idea will make India a manufacturing hub",
		"content":""
	},
	{
		"topic":"",
		"content":""
	},
	{
		"topic":"",
		"content":""
	},
	{
		"topic":"",
		"content":""
	},
	{
		"topic":"",
		"content":""
	},
	{
		"topic":"",
		"content":""
	},
	{
		"topic":"",
		"content":""
	},
	{
		"topic":"",
		"content":""
	}
]
