[
	{
		"question": "Tell me about yourself",
		"overview": "A lot of jobs require someone who can think on their feet or present ideas with crispness and clarity. This question provides employers with an early preview of your core skills, your personality and your ability to respond to an unstructured question.",
		"content": "This is something you'll be asked a lot at the beginning of an interview. Here are three tips that'll help you nail the opener.<br><br><b>Be succinct, honest and engaging.</b><br>I call this the “SHE” formula. Resist the urge to give a detailed account of the last two decades of your career. The interviewer is looking for an answer that shows them you're qualified and can respond to an unstructured question.<br><br><b>Use the job description to prepare.</b><br>Reread what they want and highlight the most required skills that you have. Are they looking for someone who can solve problems or deal with tough customers? Pick a few and brainstorm how you can describe yourself while showcasing your strengths for what they’re seeking.<br><br><b>Tie your story to their needs.</b><br>People love a good tale, so weave in some personality. For example, maybe you fell in love with the hospitality industry because your grandparents ran a bed and breakfast. Connect your story back to the job, keep it short, and be truthful.",
		"url": "https://www.google.com/"
	},
	{
		"question": "What is your greatest strength?",
		"overview": "Employers want to see if you can strike the right balance between confidence and humility. Hiring managers also want to get a sense for how self-aware and honest you are and align your strengths to the role at hand.",
		"content": "When responding to this question, you want to sound humble and not like you’re arrogant or bragging. Here are some tips to help you give them a great answer.<br><br><b>Describe a relevant experience.</b><br>If you're applying for a sales job, tell a story about a time where you helped a customer solve a problem with your solution.<br><br><b>Give specific details.</b><br>Tell them about a time you closed a deal that helped you hit a percentage of your annual number. When you share those facts with them, it helps them visualise how effective you have been.<br><br><b>Show them you’re a well-rounded person.</b><br>For example, share a story of when you used a “soft” skill, like effective communication with a coworker, and then one about you using a technical skill, which could be anything asked for in the job description.",
		"url": "https://www.google.com/"
	},
	{
		"question": "What is your greatest weakness?",
		"overview": "The interviewer is assessing whether your weaknesses will get in the way of doing the job. Employers are looking for humility and whether you’re committed to learning and growing. This is a place you can showcase what you’re doing to improve.",
		"content": "This can feel like a tricky question, but it’s a good opportunity to shine. Here are some tips on how to answer:<br><br><b>Be humble.</b><br>You want to communicate an authentic story that shows you're self-aware. It's okay that you don't come off as perfect, that's authentic, which is important for someone who will have to trust you in the role that they're hiring for.<br><br><b>Choose a trait that is not too relevant to the job.</b><br>For example, if you're applying for a project manager role, choose a weakness that is more related to creativity, which is something that doesn't disqualify you from the description of the things that would make someone successful in that role.<br><br><b>Show how you manage it.</b><br>Have a fix-it strategy. For example, if you struggle with remembering product details so you track them in their phone or side notebook, that's okay, share that with them. That shows that you've got commitment to solving that problem and addressing it.",
		"url": "https://www.google.com/"
	},
	{
		"question": "Why should we hire you?",
		"overview": "This question tests how persuasive you are. Interviewers want to see if you can make a calm, confident case for yourself, even if they’re acting skeptical. They’re looking for factual and compelling answers.",
		"content": "This is a nerve-racking question, so make sure you're set up for success. Here are some tips that can help you do well in answering it: <br><br><b>Ask yourself why you think you’re qualified.</b><br>Prepare for the interview by picking three or four qualifications and experiences that help them understand why you're a fit for this job.<br><br><b>Tell them how you’d fit in.</b><br>Paint a picture of what you’d accomplish that gives you a leg up on the competition. Also, show them why you are a great match for this company by letting them see that you know about their mission, their vision, how they operate—and how you would fit into that really well.<br><br><b>Speak authentically.</b><br>How you say something is as important as what you say. So when you're sharing your successes and you're answering these questions, speak like the best version of yourself and make sure that you're doing it in a way that allows the interviewers to connect to you.",
		"url": "https://www.google.com/"
	},
	{
		"question": "Why do you want to work here?",
		"overview": "Interviewers want to understand what prompted you to apply for this job. They don’t want candidates who are indifferent to where they work. Instead, they want someone who offers very specific reasons for why they want this job.",
		"content": "You would be amazed by how few people get this question right. So you've got a big opportunity to shine. <br><br><b>Make it all about them.</b><br>Your best answer will be about what they need. It'll show that you've done your research and have thought through what you can contribute to that team.<br><br><b>Show them how you can help.</b><br>Weave your story into the context of what you can contribute. If you have strong accounting skills and are interviewing for a finance role at a humane society, you could suggest that this job would allow you to blend your professional skills with your passion for animals.<br><br><b>Speak from the heart.</b><br>Telling a genuine story can make a big difference. For example, I once worked with a client who was applying for a zoo event manager job and she had grown up next door to that zoo and had great memories of the peacocks flying over the fence and sitting on her dad's car. So her answer was that she wanted people to have fun memories of that zoo just like she did. Try to top that.",
		"url": "https://www.google.com/"
	},
	{
		"question": "Tell me about a time you showed leadership.",
		"overview": "Employers want to understand your capacity to step up and handle tough situations that undoubtedly arise in the workplace. They want to know when you’ve seen an opening to lean in and lead with good judgment.",
		"content": "Respond to this kind of question with a compelling story that uses the 'SAR' framework: situation, action, and results. <br><br><b>Describe the situation.</b><br>Talk about the initial events that occurred. What were the problems that you were experiencing? What needed to be solved and what resources did you have--or not have? This is a really key part of the story, so it should be about three to four sentences long.<br><br><b>Get into the action.</b><br>Speak about the key milestones that you went through. Tell them what you did to turn the situation around. Don't go into too much detail though. It should only be about two to three sentences, and try to use active verbs, things like “I implemented” or “I persuaded”.<br><br><b>Show the results.</b><br>Let them know how well things turned out, how the problems were solved and what you may have learned along the way. Try to include a clincher at the end, like dollars saved or improved profitability. It drives home that you did a great thing.",
		"url": "https://www.google.com/"
	},
	{
		"question": "Describe your most challenging project.",
		"overview": "Employers want to get a sense of what ‘challenging’ means to you. They also want to know how you handled the situation in a calm way. They’re looking for a storyline to prove that you can turn a bad story into a good story.",
		"content": "Respond to this kind of question with a compelling story that uses the 'SAR' framework: situation, action, and results. <br><br><b>Describe the situation.</b><br>Talk about the initial events that occurred. What were the problems that you were experiencing? What needed to be solved and what resources did you have--or not have? This is a really key part of the story, so it should be about three to four sentences long.<br><br><b>Get into the action.</b><br>Speak about the key milestones that you went through. Tell them what you did to turn the situation around. Don't go into too much detail though. It should only be about two to three sentences, and try to use active verbs, things like “I implemented” or “I persuaded”.<br><br><b>Show the results.</b><br>Let them know how well things turned out, how the problems were solved and what you may have learned along the way. Try to include a clincher at the end, like dollars saved or improved profitability. It drives home that you did a great thing.",
		"url": "https://www.google.com/"
	},
	{
		"question": "What do you like to do outside of work or in Free-Time?",
		"overview": "Interviewers want to know you’re going to be enjoyable to have around and not just that you have the hard skills for the job. Use this question to set yourself up as interesting, fun, curious, or a go-getter.",
		"content": "With this question, employers are looking to get a feel for your likability and cultural fit. So what should you say—and not say? Here are a few tips. <br><br><b>Pick one of your favorites.</b><br>Go ahead and share something about your hobbies, volunteer work, or the places you enjoy traveling to. Maybe you're taking classes to help you accelerate your skills. In general, you just want to tell them something that's true and will paint you as an interesting, healthy, or good human being.<br><br><b>Keep it short.</b><br>For example, if you're a bird watcher in your free time, skip the 22-minute account of every species you've ever documented. Share enthusiastically so your passion shines through, but don't ramble on endlessly. Doing so might give the people to whom you're trying to make a good impression the feeling that you're nervous or that brevity just isn't your strong suit.<br><br><b>Stick to appropriate topics.</b><br>Avoid anything that might be pulverizing or offends somebody who's not a part of a particular group like politics or religion. Choose something uncontroversial or beneficial, and take advantage of the opportunity to show them that you're the complete package.",
		"url": "https://www.google.com/"
	},
	{
		"question": "Where do you see yourself in 5 years?",
		"overview": "Employers want to determine how serious you are about your career and whether your goals match the goals for this job. Employers don’t expect you to offer up a specific title you want. Instead, they want to know what you hope to accomplish.",
		"content": "The key to answering this question is to focus on what you can give to the employers or the role. Here are three tips: <br><br><b>Break the time into chunks.</b><br>Let them know what you might do in each two-to-three year period. This helps the interviewer to visualize and see what you're describing. Take them through what you plan to do in the first few years and how you plan to take it up a notch in the years after that.<br><br><b>Talk about how your goals will help them.</b><br>Paint a vivid picture about the value that you plan to deliver within each of those two-to-three year chunks that you described.<br><br><b>Avoid talking about job titles.</b><br>Resist the urge to tell them about what you want your position to be in two, three, or five years because that can come off as overly presumptuous.",
		"url": "https://www.youtube.com/watch?v=q8w8x7RYH6Q"
	},
	{
		"question": "Tell me about a time you created a goal and achieved it.",
		"overview": "Strong answers reassure interviewers about your ambition and your determination to press ahead. Pick a trivial goal, and you’re at risk of being tagged as a slacker.",
		"content": "Respond to this kind of question with a compelling story that uses the 'SAR' framework: situation, action, and results. <br><br><b>Describe the situation.</b><br>Talk about the initial events that occurred. What were the problems that you were experiencing? What needed to be solved and what resources did you have--or not have? This is a really key part of the story, so it should be about three to four sentences long.<br><br><b>Get into the action.</b><br>Speak about the key milestones that you went through. Tell them what you did to turn the situation around. Don't go into too much detail though. It should only be about two to three sentences, and try to use active verbs, things like “I implemented” or “I persuaded”.<br><br><b>Show the results.</b><br>Let them know how well things turned out, how the problems were solved and what you may have learned along the way. Try to include a clincher at the end, like dollars saved or improved profitability. It drives home that you did a great thing.",
		"url": "https://www.google.com/"
	},
	{
		"question": "Tell me about a time you had to learn something quickly.",
		"overview": "Interviewers want more than a one-time success; they’re looking for signs of a well-tested strategy that helps you gather information and put it to use. They also want to know if you feel comfortable with rapid learning.",
		"content": "Respond to this kind of question with a compelling story that uses the 'SAR' framework: situation, action, and results. <br><br><b>Describe the situation.</b><br>Talk about the initial events that occurred. What were the problems that you were experiencing? What needed to be solved and what resources did you have--or not have? This is a really key part of the story, so it should be about three to four sentences long.<br><br><b>Get into the action.</b><br>Speak about the key milestones that you went through. Tell them what you did to turn the situation around. Don't go into too much detail though. It should only be about two to three sentences, and try to use active verbs, things like “I implemented” or “I persuaded”.<br><br><b>Show the results.</b><br>Let them know how well things turned out, how the problems were solved and what you may have learned along the way. Try to include a clincher at the end, like dollars saved or improved profitability. It drives home that you did a great thing.",
		"url": "https://www.google.com/"
	},
	{
		"question": "Do you have any questions for me?",
		"overview": "This question isn’t just designed to make sure you leave with all of your questions answered; it’s intended to see if you’re prepared and to assess how curious and thoughtful you are.",
		"content": "The way you respond to this question shows employers if you're engaged, intelligent and interested. Here are some tips on how to answer: <br><br><b>Show them you’re paying attention.</b><br>It’s important to let them know you’ve been listening.You may want to take notes as the interview unfolds and then loop back to something you'd like to delve further into like an aspect of the job, the team, or the challenges that lie ahead.<br><br><b>Let them know you’re excited.</b><br>While being qualified for the job is essential, showing passion for their products, brand or industry takes it to the next level. So maybe you can ask a question about one of your favorite products they make or see how they're responding to an industry trend.<br><br><b>Get them talking about their careers.</b><br>People love talking about themselves and appreciate when you notice the interesting things they're doing. For example, you can ask them how they got from Job X to Job Y, or how their work as a musician helped them in their current career. People hire people that they like and who seem genuinely interested in the role.",
		"url": "https://www.google.com/"
	}
]
